Let's code/src/Reports/ИТК_РезультатыТестирования/ИТК_РезультатыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИТК_РезультатыТестирования</name>
</mdclass:Report>

Let's code/src/InformationRegisters/ИТК_РезультатыТестирования/ИТК_РезультатыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТК_РезультатыТестирования</name>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ИТК_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Let's code/src/Reports/ИТК_РезультатыТестирования/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытий 
 
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
  	СтандартнаяОбработка = Ложь;
    
    СтруктураРасшифровки = Новый Структура("Задача, Пользователь");  
	ПолучитьДанныеРасшифровкиСоСтруктурой(Расшифровка, СтруктураРасшифровки);
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Добавить балл");
	СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Убавить балл");
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Ничего");  
	
	СтруктураРасшифровки = Новый Структура("СтруктураРасшифровки", СтруктураРасшифровки);	
	Оповещение = Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение",
		ЭтотОбъект, СтруктураРасшифровки);  
		
	ПоказатьВопрос(Оповещение, "Что делаем?", СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	СтруктураРасшифровки = ДополнительныеПараметры1.СтруктураРасшифровки;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДобавитьБаллПоЗадаче(СтруктураРасшифровки, 1);
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ДобавитьБаллПоЗадаче(СтруктураРасшифровки, -1);
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры   

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьБаллПоЗадаче(СтруктураРасшифровки, СколькоБаллов)

	ДобавитьБаллПоЗадачеНаСервере(СтруктураРасшифровки, СколькоБаллов);	
	
КонецПроцедуры
    
&НаСервере
Процедура ДобавитьБаллПоЗадачеНаСервере(СтруктураРасшифровки, СколькоБаллов)

	МенеджерЗаписи = РегистрыСведений.ИТК_РезультатыТестирования.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Задача = СтруктураРасшифровки.Задача;
	МенеджерЗаписи.Пользователь = СтруктураРасшифровки.Пользователь;
	МенеджерЗаписи.Прочитать(); 
	
	МенеджерЗаписи.КоличествоБаллов = МенеджерЗаписи.КоличествоБаллов + СколькоБаллов;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруВозврата(ПолеИлиГруппировка, СтруктураПолей) 

	МассивРодителей = ПолеИлиГруппировка.ПолучитьРодителей();
	Для Каждого Стр Из МассивРодителей Цикл
		Если ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда 
			ПолучитьСтруктуруВозврата(Стр, СтруктураПолей);
		ИначеЕсли ТипЗнч(Стр) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ПоляГруппировки = Стр.ПолучитьПоля();
			Для Каждого гСтр Из ПоляГруппировки Цикл
				Если СтруктураПолей.Свойство(гСтр.Поле) Тогда
					Если Не ЗначениеЗаполнено(СтруктураПолей[гСтр.Поле]) Тогда
						СтруктураПолей[гСтр.Поле] = гСтр.Значение;
					КонецЕсли;
				КонецЕсли;
				ПолучитьСтруктуруВозврата(Стр, СтруктураПолей);
			КонецЦикла;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровкиСоСтруктурой(Расшифровка, СтруктураВозврата) 
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	ПолучитьСтруктуруВозврата(Данные.Элементы[Расшифровка], СтруктураВозврата);  
	
КонецФункции 

#КонецОбласти
